app/controllers/api/v1/items_controller.rb

  def index
    return render json: Item.where(id: params[:id]) if params[:id]
    return render json: Item.where(name: (params[:name]).downcase) if params[:name]
    return render json: Item.where(unit_price: params[:unit_price]) if params[:unit_price]
    return render json: Item.where(description: params[:description]) if params[:description]
    return render json: Item.where(created_at: params[:created_at].to_datetime) if params[:created_at]
    return render json: Item.where(updated_at: params[:updated_at].to_datetime) if params[:updated_at]
    return render json: Item.all
---
SELECT "items".* FROM "items"

  def show
    return render json: Item.find(params[:id]) if params[:id]
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 181], ["LIMIT", 1]]