app/controllers/api/v1/merchants_controller.rb

  def index
    return render json: Merchant.where(id: params[:id]) if params[:id]
    return render json: Merchant.where(name: params[:name]) if params[:name]
    return render json: Merchant.where(created_at: params[:created_at].to_datetime) if params[:created_at]
    return render json: Merchant.where(updated_at: params[:updated_at].to_datetime) if params[:updated_at]
    return render json: Merchant.all
---
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1  [["id", 1]]
SELECT "merchants".* FROM "merchants" WHERE "merchants"."name" = $1  [["name", "Sam"]]
SELECT "merchants".* FROM "merchants" WHERE "merchants"."created_at" = $1  [["created_at", "2017-05-01T20:13:20 00:00"]]
SELECT "merchants".* FROM "merchants" WHERE "merchants"."updated_at" = $1  [["updated_at", "2017-05-01T20:13:20 00:00"]]
SELECT "merchants".* FROM "merchants"

  def show
    return render json: Merchant.find(params[:id]) if params[:id]
    return render json: Merchant.find_by(name: params[:name]) if params[:name]
---
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."updated_at" = $1 LIMIT $2  [["updated_at", "2017-05-01T20:13:20 00:00"], ["LIMIT", 1]]
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."name" = $1 LIMIT $2  [["name", "person"], ["LIMIT", 1]]